 INSERT IN THE WORKER (WORKER_ID, FIRST_NAME, LAST_NAME, SALARY, JOINING_DATE, DEPARTMENT) VALUES (001, Monica, Arora, 100000, 14-02-20 HR), (002, Niharika, Verma, 80000, 14-06-11 14-06-11 Admin), (003, Vishal, Singhal, 300000, 14-02-20 09.00.00, HR),
(004, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'), (005, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'), (006, Vipul, Diwan, 200000, 14-06-11 09.00.00, Account), (007, Satish, Kumar, 75000, 14-0 1 -20 09.00.00, Account), (008, Geetika, Chauhan, 90000, 14-04-11 09.00.00, Admin); Create
WORKER_REF_ID ( WORKER_REF_ID INT, BONUS_AMOUNT INT(10), BONUS_DATE DATETIME, FOREIGN KEY (WORKER_REF_ID) REFERENCES WHEN DELETING WORKER_ID DATA); INSERT BONUS (WORKER_REF_ID, BONUS_AMOUNT, BONUS_DATE) VALUES (001, 5000, 16-02-20), (002, 3000,
16-06-11), (003, 4000, 16-02-20), (001, 4500, 16-02-20), (002, 3500, 16-06-11); TABLE Title ( WORKER_REF_ID INT, WORKER_TITLE CHAR[25), AFFECTED_FROM DATETIME, FOREIGN KEY (WORKER_REF_ID) REFERENCES Worker(WORKER_ID) ON DELETE CASCADE; PASTE INTO address
(WORKER_REF_ID, WORKER_TITLE, AFFECTED_FROM) VALUES (001, Manager, 2016-02-20 00:00:00), (002, Executive, 2016-06-11 00:00:00), (008, Executive, 2016-06-11 00:00:00), (005, Manager, '2016-06-11 00:00:00'), (004, Asst. Manager, '2016-06-11 00:00:00'), (007, 'Executive', '2016-06-1 1 00:00:00'),
(006, 'Lead', '2016-06-11 00:00:00'), (003, 'Lead', '2016-06-11 00:00:00');

In [1]:
import mysql.connector as conn

In [2]:
mydb=conn.connect(host='localhost',user='root',password='divineland')

In [3]:
cursor=mydb.cursor()

In [4]:
cursor.execute('show databases')

In [5]:
cursor.fetchall()

[('bank',),
 ('ineuron',),
 ('ineuron1',),
 ('information_schema',),
 ('mysql',),
 ('org',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [6]:
cursor.execute('use org;')

In [66]:
cursor.execute('drop table worker;')

In [67]:
cursor.execute('create table WORKER (WORKER_ID int(15), FIRST_NAME varchar(25), LAST_NAME char(25), WAGE INT(15),DEPARTMENT char(10));')

In [72]:
cursor.execute("INSERT into WORKER values (001, 'Monica', 'Arora', 100000, 'HR'), (002, 'Niharika', 'Verma', 80000, 'Admin'), (003, 'Vishal', 'Singhal', 300000, 'HR'),(004, 'Amitabh', 'Singh', 500000, 'Admin'), (005, 'Vivek', 'Bhati', 500000, 'Admin'), (006, 'Vipul', 'Diwan', 200000, 'Account'), (007, 'Satish', 'Kumar', 75000, 'Account'), (008, 'Geetika', 'Chauhan', 90000, 'Admin');")

In [73]:
cursor.execute('select * from worker')

In [74]:
cursor.fetchall()

[(1, 'Monica', 'Arora', 100000, 'HR'),
 (2, 'Niharika', 'Verma', 80000, 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, 'HR'),
 (4, 'Amitabh', 'Singh', 500000, 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, 'Account'),
 (7, 'Satish', 'Kumar', 75000, 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, 'Admin'),
 (1, 'Monica', 'Arora', 100000, 'HR'),
 (2, 'Niharika', 'Verma', 80000, 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, 'HR'),
 (4, 'Amitabh', 'Singh', 500000, 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, 'Account'),
 (7, 'Satish', 'Kumar', 75000, 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, 'Admin')]

# Q-1. Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as <WORKER_NAME>;.

In [75]:
cursor.execute('select FIRST_NAME as WORKER_NAME from worker')

In [76]:
cursor.fetchall()

[('Monica',),
 ('Niharika',),
 ('Vishal',),
 ('Amitabh',),
 ('Vivek',),
 ('Vipul',),
 ('Satish',),
 ('Geetika',),
 ('Monica',),
 ('Niharika',),
 ('Vishal',),
 ('Amitabh',),
 ('Vivek',),
 ('Vipul',),
 ('Satish',),
 ('Geetika',)]

# Q-2. Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

In [77]:
cursor.execute('select distinct department from worker')

In [78]:
cursor.fetchall()

[('HR',), ('Admin',), ('Account',)]

# Q-3. Write an SQL query to show the last 5 record from a table.

In [84]:
cursor.execute('select * from(select * from worker order by worker_id desc limit 5)var1 order by worker_id asc')

In [85]:
cursor.fetchall()

[(6, 'Vipul', 'Diwan', 200000, 'Account'),
 (7, 'Satish', 'Kumar', 75000, 'Account'),
 (7, 'Satish', 'Kumar', 75000, 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, 'Admin'),
 (8, 'Geetika', 'Chauhan', 90000, 'Admin')]